app/controllers/cars_controller.rb

  def index
    ownerships = current_user.ownerships
    @cars = []

    ownerships.each do |ownership|
---
SELECT "ownerships".* FROM "ownerships" WHERE "ownerships"."user_id" = ?  [["user_id", 1]]

  def create
    @car = Car.new(car_params)
    if @car.save
      ownership = Ownership.new( user_id: current_user.id, car_id: @car.id )
      ownership.save
---
INSERT INTO "cars" ("car_model", "created_at", "make", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["car_model", "Accord"], ["created_at", Wed, 09 Apr 2014 02:32:40 UTC +00:00], ["make", "Honda"], ["updated_at", Wed, 09 Apr 2014 02:32:40 UTC +00:00], ["year", 2005]]
INSERT INTO "ownerships" ("car_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["car_id", 4], ["created_at", Wed, 09 Apr 2014 02:54:04 UTC +00:00], ["updated_at", Wed, 09 Apr 2014 02:54:04 UTC +00:00], ["user_id", 1]]

  def destroy
    car = Car.find(params[:id])
    if car.destroy
      ownerships = Ownership.where(car_id: car.id)
      ownerships.destroy_all
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 4]]
SELECT "ownerships".* FROM "ownerships" WHERE "ownerships"."car_id" = 7
DELETE FROM "ownerships" WHERE "ownerships"."id" = ?  [["id", 4]]